"use strict";

/*
Необходимо попросить пользователя ввести три числа.
Необходимо создать функцию, в которую мы должны передать эти три числа.
Функция должна определить максимальное, среди переданных ей значение и 
вывести сообщение: "Максимальное значение среди чисел N1, N2, N3 равно N."

Примечание: Условимся, что пользователь всегда вводит корректные значения, 
три числа. Проверять их не нужно.
*/

// const userNumFst = Number(prompt('Введите первое число'));
// const userNumSnd = Number(prompt('Введите второе число'));
// const userNumTrd = Number(prompt('Введите третье число'));

// function maxOfTree(num1, num2, num3) {
//     return Math.max(num1, num2, num3)
// }

// console.log(`Максимальное значение среди чисел ${userNumFst}, ${userNumSnd}, ${userNumTrd} равно ${maxOfTree(userNumFst, userNumSnd, userNumTrd)}`);


// Сдесь можно использовать массив